1s/ERP/Conf/Enums/СтатусыОбработкиСписанияПартииЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбработкиСписанияПартииЗЕРНО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПартииКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПартииОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПартииОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартииСписаны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартииСписаныЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеОбрабатывается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СтатусыОбработкиСписанияПартииЗЕРНО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Массив статусов, в которых проведенный документ требует резервирования исходной партии.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СтатусыОбработкиОформлениеСДИЗЗЕРНО - Требует резервирования партии
Функция ТребуетРезервированияПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Черновик);
	Результат.Добавить(СписаниеПартииКПередаче);
	Результат.Добавить(СписаниеПартииОбрабатывается);
	Результат.Добавить(СписаниеПартииОшибкаПередачи);
	Результат.Добавить(ПартииСписаныЧастично);
	Результат.Добавить(Ошибка);
	Возврат Результат;
	
КонецФункции

// Массив статусов, в которых проведенный документ требует списания исходной партии.
// 
// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.СтатусыОбработкиОформлениеСДИЗЗЕРНО - Требует списания партии
Функция ТребуетСписанияПартии() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПартииСписаны);
	Результат.Добавить(АннулированиеКПередаче);
	Результат.Добавить(АннулированиеОбрабатывается);
	Результат.Добавить(АннулированиеОшибкаПередачи);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
